DataProcessors/ВыгрузитьБланкЗаказПоКонтрагентам/ВыгрузитьБланкЗаказПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузитьБланкЗаказПоКонтрагентам</name>
  <attributes>
    <name>ДатаБланкЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентСписок</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыЦенНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправитьЭлСообщение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавимЗащиту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <resources>
    <name>абс_ФайлДопДанных</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДатаАктуальностиКИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/ТипыЦенПоГруппамНоменклатурыДляПокупателей/ТипыЦенПоГруппамНоменклатурыДляПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТипыЦенПоГруппамНоменклатурыДляПокупателей</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
</mdclass:Enum>

Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EmailОрганизации</name>
      <description>Email организации</description>
    </items>
    <items>
      <name>EmailФизЛица</name>
      <description>Email физ. лица</description>
    </items>
    <items>
      <name>ИнформАдресФизЛица</name>
      <description>Адрес для информирования физ. лица</description>
    </items>
    <items>
      <name>АдресДоставкиКонтрагента</name>
      <description>Адрес доставки</description>
    </items>
    <items>
      <name>ЮрАдресФизЛица</name>
      <description>Адрес по прописке физ. лица</description>
    </items>
    <items>
      <name>ФактАдресФизЛица</name>
      <description>Адрес проживания физ. лица</description>
    </items>
    <items>
      <name>ИнострАдресФизЛица</name>
      <description>Адрес физ. лица за пределами РФ </description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтактногоЛицаКонтрагента</name>
      <description>Адрес электронной почты контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами</name>
      <description>Адрес электронной почты контрагента для обмена электронными документами</description>
    </items>
    <items>
      <name>КонтактнТелефонКандидата</name>
      <description>Контактн телефон кандидата</description>
    </items>
    <items>
      <name>абс_МестоДоставки</name>
      <description>Место доставки</description>
    </items>
    <items>
      <name>МобильныйТелефонКонтактногоЛицаКонтрагента</name>
      <description>Мобильный телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресОрганизацииПочтовый</name>
      <description>Почтовый адрес организации</description>
    </items>
    <items>
      <name>РабочийТелефонКонтактногоЛицаКонтрагента</name>
      <description>Рабочий телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>СлужебныйАдресЭлектроннойПочтыПользователя</name>
      <description>Служебный адрес электронной почты пользователя</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>ТелефонПоЮрАдресуОрганизации</name>
      <description>Телефон по юридическому адресу организации</description>
    </items>
    <items>
      <name>ТелефонФизЛица</name>
      <description>Телефон физ.лица домашний</description>
    </items>
    <items>
      <name>ТелефонСлужебный</name>
      <description>Телефон физ.лица служебный</description>
    </items>
    <items>
      <name>АдресИнострОрганизацииУчред</name>
      <description>Учредительный адрес иностранной организации</description>
    </items>
    <items>
      <name>ФаксКонтрагента</name>
      <description>Факс контрагента</description>
    </items>
    <items>
      <name>ФаксОрганизации</name>
      <description>Факс организации</description>
    </items>
    <items>
      <name>ФактАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ФактАдресОрганизации</name>
      <description>Фактический адрес организации</description>
    </items>
    <items>
      <name>ЮрАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
    <items>
      <name>ЮрАдресОрганизации</name>
      <description>Юридический адрес организации</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаКонтактнойИнформации</name>
    <type>
      <types>EnumRef.ВидыОбъектовКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

DataProcessors/ВыгрузитьБланкЗаказПоКонтрагентам/ObjectModule.bsl
Перем ТекСтрокаТЧ;
Перем Цвет_СветлоЗеленый;	
Перем Цвет_СветлоЖелтый;	
Перем Цвет_СветлоКоричневый;	
Перем Цвет_СветлоСерый;	
Перем Цвет_Красный;	
Перем Цвет_Зеленый;	
Перем Цвет_Синий;
Перем Цвет_СветлоСветлоЗеленый;

Функция ОчиститьНаименование(НаименКонтрагента)
	НаименованиеКонтрагента	=	СокрЛП(НаименКонтрагента);
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,Символ(34),"");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,"-","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,"+","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,"=","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,",","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,".","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,"\","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,"/","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,"(","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,")","");
	НаименованиеКонтрагента	=	СтрЗаменить(НаименованиеКонтрагента,"_"," ");
	Возврат НаименованиеКонтрагента;
КонецФункции

Функция ПолучитьКонтактнуюИнформацию(ОбъектКИ, ТипКИ, ВидКИ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ОбъектКИ);
	Запрос.УстановитьПараметр("Тип"   , ТипКИ);
	Запрос.УстановитьПараметр("Вид"   , ВидКИ);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И
	|	КонтактнаяИнформация.Тип = &Тип
	|	И
	|	КонтактнаяИнформация.Вид = &Вид
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьПисьмо(Адрес, ПриложенныйФайл, ТекКонтрагент)
    emailОтправителя = "";
    АдресПользователяСтр = ПолучитьКонтактнуюИнформацию(ПараметрыСеанса.ТекущийПользователь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
    МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресПользователяСтр, ",");
    Для каждого АдресПользователя из МассивАдресовВрем Цикл
    	emailОтправителя = АдресПользователя;
		Прервать;
    КонецЦикла;
    
    Если emailОтправителя = "" тогда
    	Сообщить("Не указан служебный адрес электронной почты пользователя.");
		Возврат;
    КонецЕсли;

    
    emailПолучателя = Адрес;
 //   АдресПоучателяСтр = абс_УправлениеДебиторскойЗадолженностью.ПолучитьКонтактнуюИнформацию(Контрагент, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000070"));
 //   МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресПоучателяСтр, ",");
 //   Для каждого АдресПолучателя из МассивАдресовВрем Цикл
 //   	emailПолучателя = АдресПолучателя;		
 //   КонецЦикла;
    
    Если emailПолучателя = "" тогда
    	Сообщить("Не указан адрес электронной почты контрагента для отправки актов сверки.");
		Возврат;
    КонецЕсли;
    
    //получим эл.адрес ответственного менеджера контрагента
	АдресМенеджераКонтрагента = "";
    МенеджерКонтрагента = ТекКонтрагент.ОсновнойМенеджерПокупателя;
    Если ЗначениеЗаполнено(МенеджерКонтрагента) Тогда
    	АдресМенеджераКонтрагента = ПолучитьКонтактнуюИнформацию(МенеджерКонтрагента, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
    	АдресМенеджераКонтрагента = СтрЗаменить(АдресМенеджераКонтрагента,",",";");
    КонецЕсли;
    
    Если emailПолучателя = "" тогда
    	Сообщить("Не указан адрес электронной почты контрагента для отправки актов сверки.");
		Возврат;
    КонецЕсли;
    
    ТемаПисьма = "" + Организация.НаименованиеСокращенное + ": Бланк-Заказ товара от "+ Формат(ДатаБланкЗаказа,"ДФ=dd.MM.yyyy");
    
    ТекстПисьма = "Здравствуйте! " + Символы.ПС + Организация.НаименованиеСокращенное  + " направляет Бланк-Заказ товара от "  + Формат(ДатаБланкЗаказа,"ДФ=dd.MM.yyyy")+ "." + Символы.ПС;
    ТекстПисьма = ТекстПисьма + "Для удовлетворения потребности в нашем товаре, просим заполнить колонку «Заказ шт.» (кратно количеству шт. в коробах) в прилагаемом Бланк-Заказе и переслать " + АдресМенеджераКонтрагента + "и zakaz@leovit.ru." + Символы.ПС;

    ПодписьПисьма =  "";
    Попытка
    	Outlook = Новый COMОбъект("Outlook.Application");
    Исключение
    	
   	КонецПопытки;
 
   	Письмо = Outlook.CreateItem(0);
    
    Попытка
   		Письмо.Display(); //или, например, Письмо.Send(), отправка зразу?; 
    Исключение
    	
    КонецПопытки;

    //Письмо.Display();  // важно перед манипуляцией с подписью вызвать, ибо не получится
    сПодписи = Письмо.HTMLBody;
    Письмо.Body        = ТекстПисьма;
    Письмо.HTMLBody    = Письмо.HTMLBody + сПодписи;
    
    Письмо.Subject = ТемаПисьма;
    Если ЗначениеЗаполнено(emailПолучателя) Тогда
   		 Письмо.Recipients.Add(emailПолучателя);
    КонецЕсли;	 
   	Письмо.Attachments.Add(ПриложенныйФайл);
    Если  АдресМенеджераКонтрагента <> "" Тогда
    	Письмо.CC = СокрЛП(АдресМенеджераКонтрагента)+"; zakaz@leovit.ru";
	КонецЕсли;
	
	Письмо.Send();
    //{Катанович // отключение уведомление о доставке, уведомление о прочтении
    //Письмо.ReadReceiptRequested  = Истина;
    //Письмо.OriginatorDeliveryReportRequested = Истина;
    //Катанович}
КонецПроцедуры

Процедура ВыравнитьПоГоризонтуЦентр(Лист, НомерСтроки, КолКолонок)
	//выравниваем по центру
	ТекКолонка	=	0;
	Пока ТекКолонка<КолКолонок Цикл
		ТекКолонка	=	ТекКолонка+1;
		Лист.Cells(НомерСтроки, ТекКолонка).HorizontalAlignment= -4108;
    КонецЦикла;
КонецПроцедуры

Процедура ВыделимЖирнымШрифтом(Лист, НомерСтроки, КолКолонок)
	//жирный шрифт в ячейке
	ТекКолонка	=	0;
	Пока ТекКолонка<КолКолонок Цикл
		ТекКолонка	=	ТекКолонка+1;
		Лист.Cells(НомерСтроки, ТекКолонка).Font.Bold = 1;
    КонецЦикла;
КонецПроцедуры

Процедура УстановкаЦветаРамки(Лист, НомерСтроки, КолКолонок)
	//задать цвет рамки
	ТекКолонка	=	0;
	Пока ТекКолонка<КолКолонок Цикл
		ТекКолонка	=	ТекКолонка+1;
		Лист.Cells(НомерСтроки, ТекКолонка).Borders.Color = 1;
    КонецЦикла;
КонецПроцедуры

Процедура ПереноситьПоСловам(Лист, НомерСтроки, КолКолонок)
	//переносить по словам
	ТекКолонка	=	0;
	Пока ТекКолонка<КолКолонок Цикл
		ТекКолонка	=	ТекКолонка+1;
		Лист.Cells(НомерСтроки, ТекКолонка).WrapText = True;
    КонецЦикла;
КонецПроцедуры

Процедура ВыделитьЦветомСтроку(Лист, НомерСтроки, КолКолонок,ЗаданныйЦвет)
	//задать цвет ячейкам
	ТекКолонка	=	0;
	Пока ТекКолонка<КолКолонок Цикл
		ТекКолонка	=	ТекКолонка+1;
		Лист.Cells(НомерСтроки, ТекКолонка).Interior.Color 	= ЗаданныйЦвет;
    КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСтрокуПоГруппе(Лист, ГруппаНоменклатуры)
	ТекСтрокаТЧ	=	ТекСтрокаТЧ+1;
    Лист.Cells(ТекСтрокаТЧ, 3).Value	= ГруппаНоменклатуры.Наименование;
	Лист.Cells(ТекСтрокаТЧ, 3).Font.Bold = 1;
	ВыделитьЦветомСтроку(Лист, ТекСтрокаТЧ, 10,Цвет_СветлоСерый);
	//подкрасим 4 колонку зеленым
	Лист.Cells(ТекСтрокаТЧ, 4).Interior.Color 	= Цвет_СветлоСветлоЗеленый;
	УстановкаЦветаРамки(Лист, ТекСтрокаТЧ, 10);
КонецПроцедуры

Процедура ЗаполнитьСтрокуНаименование(Лист, Выборка, ТипЦенКонтрагентаОсновная, Значение_Вывод)
	ТекСтрокаТЧ	=	ТекСтрокаТЧ+1;
	
	ШтрихКод	=	лео_ДопФункции.Получить_ШтрихКод(Выборка.Номенклатура, ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13, Выборка.ЕдиницаИзмерения, Справочники.Качество.Новый);
	Коэффициент	=	ПолучитьКоличествоВУпаковке(Выборка.Номенклатура);
	Спр_ЕдИзмерения	=	лео_ДопФункции.Получить_ЕдиницуИзмерения(Выборка.Номенклатура, Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("778"));
	
	Лист.Cells(ТекСтрокаТЧ, 1).NumberFormat = "@";
    Лист.Cells(ТекСтрокаТЧ, 1).Value	= ""+Выборка.Номенклатура.Артикул;
	Лист.Cells(ТекСтрокаТЧ, 2).NumberFormat = "@";
    Лист.Cells(ТекСтрокаТЧ, 2).Value	= ""+ШтрихКод;
    Лист.Cells(ТекСтрокаТЧ, 3).Value	= ""+?(ПолноеНаименование, Выборка.Номенклатура.НаименованиеПолное, Выборка.Номенклатура.Наименование);
	//переносить по словам
	Лист.Cells(ТекСтрокаТЧ, 3).WrapText = True;
	//по запросу Воронова подкрашиваем наименования и артикул
	Если лео_ДопФункции.Получить_ЗначенияКатегорииОбъектов(Выборка.Номенклатура, Справочники.КатегорииОбъектов.НайтиПоКоду("000000121")) Тогда
		Лист.Cells(ТекСтрокаТЧ, 1).Font.ColorIndex	= 5;
		Лист.Cells(ТекСтрокаТЧ, 3).Font.ColorIndex	= 5;
		Лист.Cells(ТекСтрокаТЧ, 3).Font.Bold = 1;                         //1 — жирный шрифт, 0 — обычный.
	ИначеЕсли Значение_Вывод=Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000723") Тогда
    	Лист.Cells(ТекСтрокаТЧ, 3).Value	= "** "+?(ПолноеНаименование, Выборка.Номенклатура.НаименованиеПолное, Выборка.Номенклатура.Наименование);
		Лист.Cells(ТекСтрокаТЧ, 1).Font.ColorIndex	= 3;
		Лист.Cells(ТекСтрокаТЧ, 3).Font.ColorIndex	= 3;
		Лист.Cells(ТекСтрокаТЧ, 3).Font.Bold = 1;                         //1 — жирный шрифт, 0 — обычный.
	КонецЕсли;	
    Лист.Cells(ТекСтрокаТЧ, 4).Value		= "";
	Лист.Cells(ТекСтрокаТЧ, 4).Font.Size 	= 12;
	Лист.Cells(ТекСтрокаТЧ, 4).Font.Bold 	= 1;
	Лист.Cells(ТекСтрокаТЧ, 4).Interior.Color 	= Цвет_СветлоСветлоЗеленый;
    Лист.Cells(ТекСтрокаТЧ, 5).Value		= Коэффициент;
	//Лист.Cells(ТекСтрокаТЧ, 6).Value		= Выборка.Цена;
    Лист.Cells(ТекСтрокаТЧ, 6).Value		= Ценообразование.ОкруглитьЦену(Выборка.Цена, ТипЦенКонтрагентаОсновная.ПорядокОкругления, Ложь);
	Лист.Cells(ТекСтрокаТЧ, 6).NumberFormat = "# ##0,00";
	//Лист.Cells(ТекСтрокаТЧ, 7).FormulaLocal = "=D"+Строка(ТекСтрокаТЧ)+"/E"+Строка(ТекСтрокаТЧ);               //формула   
    Лист.Cells(ТекСтрокаТЧ, 7).FormulaLocal = "=ЕСЛИ(ОСТАТ(D"+Строка(ТекСтрокаТЧ)+";E"+Строка(ТекСтрокаТЧ)+")>0;""!!!"";D"+Строка(ТекСтрокаТЧ)+"/E"+Строка(ТекСтрокаТЧ)+")";               //формула        =ЕСЛИ(ОСТАТ(D12;E12)>0;"!!!";D12/E12)
	//Лист.Cells(ТекСтрокаТЧ, 8).FormulaLocal = "=F"+Строка(ТекСтрокаТЧ)+"*D"+Строка(ТекСтрокаТЧ);               //формула
    Лист.Cells(ТекСтрокаТЧ, 8).FormulaLocal = "=ЕСЛИ(ОСТАТ(D"+Строка(ТекСтрокаТЧ)+";E"+Строка(ТекСтрокаТЧ)+")>0;""!!!"";F"+Строка(ТекСтрокаТЧ)+"*D"+Строка(ТекСтрокаТЧ)+")"; 
	Лист.Cells(ТекСтрокаТЧ, 8).NumberFormat = "# ##0,00";
	//Лист.Cells(ТекСтрокаТЧ,10).FormulaLocal = "=H"+Строка(ТекСтрокаТЧ)+"+H"+Строка(ТекСтрокаТЧ)+"*I"+Строка(ТекСтрокаТЧ);               //формула
    Лист.Cells(ТекСтрокаТЧ,10).FormulaLocal = "=ЕСЛИ(ОСТАТ(D"+Строка(ТекСтрокаТЧ)+";E"+Строка(ТекСтрокаТЧ)+")>0;""!!!"";H"+Строка(ТекСтрокаТЧ)+"+H"+Строка(ТекСтрокаТЧ)+"*I"+Строка(ТекСтрокаТЧ)+")"; 
	Лист.Cells(ТекСтрокаТЧ,10).NumberFormat = "# ##0,00";
	Если Выборка.Номенклатура.СтавкаНДС=Перечисления.СтавкиНДС.НДС10 Тогда 
    	Лист.Cells(ТекСтрокаТЧ, 9).Value	= "10%";
	ИначеЕсли Выборка.Номенклатура.СтавкаНДС=Перечисления.СтавкиНДС.НДС18 Тогда
    	Лист.Cells(ТекСтрокаТЧ, 9).Value	= "18%";
	ИначеЕсли Выборка.Номенклатура.СтавкаНДС=Перечисления.СтавкиНДС.НДС20 Тогда
    	Лист.Cells(ТекСтрокаТЧ, 9).Value	= "20%";     
	ИначеЕсли Выборка.Номенклатура.СтавкаНДС=Перечисления.СтавкиНДС.НДС5 Тогда
    	Лист.Cells(ТекСтрокаТЧ, 9).Value	= "5%";
	ИначеЕсли Выборка.Номенклатура.СтавкаНДС=Перечисления.СтавкиНДС.НДС7 Тогда
    	Лист.Cells(ТекСтрокаТЧ, 9).Value	= "7%";
	Иначе
    	Лист.Cells(ТекСтрокаТЧ, 9).Value	= "0%";
	КонецЕсли;	
	
	//колонки выделенные жирным
	Лист.Cells(ТекСтрокаТЧ, 4).Font.Bold = 1;                         //1 — жирный шрифт, 0 — обычный.
	Лист.Cells(ТекСтрокаТЧ, 6).Font.Bold = 1;                         //1 — жирный шрифт, 0 — обычный.
	Лист.Cells(ТекСтрокаТЧ, 8).Font.Bold = 1;                         //1 — жирный шрифт, 0 — обычный.
	Лист.Cells(ТекСтрокаТЧ,10).Font.Bold = 1;                         //1 — жирный шрифт, 0 — обычный.
	
	//
	Лист.Cells(ТекСтрокаТЧ, 6).Interior.Color 	= Цвет_СветлоЖелтый;
	Лист.Cells(ТекСтрокаТЧ, 8).Interior.Color 	= Цвет_СветлоЖелтый;
	Лист.Cells(ТекСтрокаТЧ,10).Interior.Color 	= Цвет_СветлоЖелтый;
	УстановкаЦветаРамки(Лист, ТекСтрокаТЧ, 10);
	
	//
    Лист.Cells(ТекСтрокаТЧ,11).FormulaLocal = "=ЕСЛИ(ОСТАТ(D"+Строка(ТекСтрокаТЧ)+";E"+Строка(ТекСтрокаТЧ)+")>0;""! НЕ КРАТНО КОРОБУ"";"""")"; 
	Лист.Cells(ТекСтрокаТЧ,11).Font.ColorIndex	= 3;
	
	//Колонки Вес, ВесНетто, Объем
    Лист.Cells(ТекСтрокаТЧ, 12).Value	= Спр_ЕдИзмерения.Вес;
    Лист.Cells(ТекСтрокаТЧ, 13).Value	= Спр_ЕдИзмерения.ВесНетто;
    Лист.Cells(ТекСтрокаТЧ, 14).Value	= Спр_ЕдИзмерения.Объем;
	//Колонки ИТОГИ Вес, ВесНетто, Объем
    Лист.Cells(ТекСтрокаТЧ, 16).FormulaLocal = "=G"+Строка(ТекСтрокаТЧ)+"*L"+Строка(ТекСтрокаТЧ);
    Лист.Cells(ТекСтрокаТЧ, 17).FormulaLocal = "=G"+Строка(ТекСтрокаТЧ)+"*M"+Строка(ТекСтрокаТЧ);
    Лист.Cells(ТекСтрокаТЧ, 18).FormulaLocal = "=G"+Строка(ТекСтрокаТЧ)+"*N"+Строка(ТекСтрокаТЧ);
	
	//сделаем ячейку доступной для редактирования
	Лист.Cells(ТекСтрокаТЧ, 4).Locked=0;	
КонецПроцедуры

Процедура ОбработкаДанныхТабличнойЧасти(Лист, ТекКонтрагент)
	
	Если ЗначениеЗаполнено(ТипыЦенНоменклатуры) Тогда 
		ТипЦенКонтрагента	=	ТипыЦенНоменклатуры;
	Иначе	
	ТипЦенКонтрагента	=	РегистрыСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей.ПолучитьПоследнее(ДатаБланкЗаказа,Новый Структура("абс_ДоговорКонтрагента",ТекКонтрагент.ОсновнойДоговорКонтрагента)).ТипЦен;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипЦенКонтрагента) Тогда
		Сообщить("По контрагенту "+ СокрЛП(ТекКонтрагент.Наименование)+ " отсутствует -ТИП ЦЕН-");
		Возврат;	
	КонецЕсли;
	ПроцентСкидкиНаценки	=	0;
	ТипЦенКонтрагентаОсновная	=	ТипЦенКонтрагента;
	Если ТипЦенКонтрагента.Рассчитывается Тогда
		ПроцентСкидкиНаценки		=	ТипЦенКонтрагента.ПроцентСкидкиНаценки;
		ПорядокОкругления			=	ТипЦенКонтрагента.ПорядокОкругления;
		//ТипЦенКонтрагентаОсновная	=	ТипЦенКонтрагента;
		ТипЦенКонтрагента			=	ТипЦенКонтрагента.БазовыйТипЦен;
	КонецЕсли;
	
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	            	 	|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * (100 + &ПроцентСкидкиНаценки) / 100 КАК ЧИСЛО(8, 4)) КАК Цена,
	            	 	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
	            	 	|	ЦеныНоменклатурыСрезПоследних.Валюта,
	            	 	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Родитель КАК НоменклатураРодитель,
	            	 	|	ЗначенияСвойствОбъектов.Значение
	            	 	|ИЗ
	            	 	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	            	 	|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЗначенияСвойствОбъектов.Объект
	            	 	|ГДЕ
	            	 	|	ЗначенияСвойствОбъектов.Свойство = &ЗначениеСвойства_СтатусПроизводства
	            	 	|
	            	 	|УПОРЯДОЧИТЬ ПО
	            	 	|	НоменклатураРодитель,
	            	 	|	Номенклатура";
	Запрос.УстановитьПараметр("ТипЦен",ТипЦенКонтрагента);
	Запрос.УстановитьПараметр("ПроцентСкидкиНаценки",ПроцентСкидкиНаценки);
	Запрос.УстановитьПараметр("ЗначениеСвойства_СтатусПроизводства",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000127"));
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	ГруппаНоменклатуры	=	"";	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) ИЛИ
			 Выборка.Значение=Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000660") ИЛИ
			 Выборка.Значение=Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000000801") ИЛИ
			 Выборка.Значение=Справочники.ЗначенияСвойствОбъектов.НайтиПоКоду("000003033") Тогда
			 Продолжить;
		КонецЕсли;
		Если НЕ Выборка.НоменклатураРодитель=ГруппаНоменклатуры Тогда	
			ГруппаНоменклатуры	=	Выборка.НоменклатураРодитель;
			//Заполним строку Группы
			//Сообщить(ГруппаНоменклатуры);
			ЗаполнитьСтрокуПоГруппе(Лист, ГруппаНоменклатуры);
		КонецЕсли;
		//Сообщить(Выборка.Номенклатура);				
	    ЗаполнитьСтрокуНаименование(Лист, Выборка, ТипЦенКонтрагентаОсновная, Выборка.Значение);
	
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьКоличествоВУпаковке(Номенклатура)
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	ЕдиницыИзмерения.Коэффициент
	            	 	|ИЗ
	            	 	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	            	 	|ГДЕ
	            	 	|	ЕдиницыИзмерения.Владелец = &Номенклатура
	            	 	|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("упак"));
	Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат	Выборка.Коэффициент;
	КонецЕсли;
	Возврат 0;	
КонецФункции

Функция ЗаполнитьШапкуБланкЗаказ(ТекДоговорКонтрагента)
	
	ТекКонтрагент	=	ТекДоговорКонтрагента.Владелец.Ссылка;
	ТекСтрокаТЧ		=	9;

	Эксель = Новый COMОбъект("Excel.Application");
	Эксель.DisplayAlerts = 0;
	Эксель.ScreenUpdating = 0;
	Эксель.EnableEvents = 0;
	Книга = Эксель.WorkBooks.Add();
	Лист = Книга.WorkSheets(1);
	
	//закрепить область
	Лист.Application.ActiveWindow.SplitRow = 9;
	Лист.Application.ActiveWindow.FreezePanes = 3;	
			
	//Зададим ширину колонок		
	Лист.Columns(1).ColumnWidth 	= 8;
	Лист.Columns(2).ColumnWidth 	= 15;
	Лист.Columns(3).ColumnWidth 	= 80;
	Лист.Columns(4).ColumnWidth 	= 8;
	Лист.Columns(5).ColumnWidth		= 12;
	Лист.Columns(6).ColumnWidth 	= 12;
	Лист.Columns(7).ColumnWidth 	= 12;
	Лист.Columns(8).ColumnWidth 	= 12;
	Лист.Columns(9).ColumnWidth 	= 10;
	Лист.Columns(10).ColumnWidth 	= 15;
	
	//Заполняем шабку бланка
	Лист.Cells(1, 1).Value	= "!!!   Заводской короб неделим и является минимальной единицей заказа и отгрузки !!!!";
	Лист.Cells(1, 1).Font.ColorIndex	= 3;
	Лист.Cells(1, 1).Font.Size 			= 16;
	Лист.Cells(1, 1).Font.Bold 			= 1;
	Лист.Cells(6, 3).Value	= "!!!   Новые позиции, введенные в прайс !!!!";
	Лист.Cells(6, 3).Font.ColorIndex	= 5;
	Лист.Cells(6, 3).Font.Size 			= 12;
	Лист.Cells(6, 3).Font.Bold 			= 1;
	Лист.Cells(7, 3).Value	= "** Артикул выводится из ассортимента. При Заказе уточнять наличие и остаток **";
	Лист.Cells(7, 3).Font.ColorIndex	= 3;
	Лист.Cells(7, 3).Font.Size 			= 12;
	Лист.Cells(7, 3).Font.Bold 			= 1;

	Лист.Cells(1, 9).Value	= "Дата актуальности цен";
	Лист.Cells(1, 9).HorizontalAlignment= -4152;
	//Лист.Cells(1, 9).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(1,10).Value  = Формат(ДатаБланкЗаказа,"ДЛФ=Д");
	Лист.Cells(1,10).Font.ColorIndex	= 3;
	Лист.Cells(1,10).Font.Bold 			= 1;

	Лист.Cells(2, 2).Value	= "Поставщик";
	Лист.Cells(2, 2).HorizontalAlignment= -4152;
	Лист.Cells(2, 1).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(2, 2).Interior.Color 	= Цвет_СветлоЗеленый;

	Лист.Cells(2, 3).Value	= СокрЛП(Организация.НаименованиеПолное);

	Лист.Cells(3, 2).Value	= "Покупатель";
	Лист.Cells(3, 2).HorizontalAlignment= -4152;
	Лист.Cells(3, 1).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(3, 2).Interior.Color 	= Цвет_СветлоЗеленый;

	Лист.Cells(3, 3).Value	= ""+СокрЛП(ТекКонтрагент.НаименованиеПолное)+", договор №"+ТекДоговорКонтрагента.Номер+" от "+Формат(ТекДоговорКонтрагента.Дата,"ДЛФ=Д");
	Лист.Cells(3, 5).Value	= "Планируемая дата отгрузки";
	Лист.Cells(3, 5).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(3, 6).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(4, 5).Value	= "(ДД.ММ.ГГГГ)";
	Лист.Cells(4, 5).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(4, 6).Borders.Color = 1;
	
	//сделаем ячейку доступной для редактирования
	Лист.Cells(4, 6).Locked=0;	

	Лист.Cells(4, 2).Value	= "АдресДоставки";
	Лист.Cells(4, 2).HorizontalAlignment= -4152;
	Лист.Cells(4, 1).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(4, 2).Interior.Color 	= Цвет_СветлоЗеленый;
	Лист.Cells(4, 3).Borders.Color = 1;
	
	//сделаем ячейку доступной для редактирования
	Лист.Cells(4, 3).Locked=0;	
	

	Лист.Cells(2, 9).Value	= "Масса брутто, кг";
	Лист.Cells(2, 9).HorizontalAlignment= -4152;
	Лист.Cells(3, 9).Value	= "Масса нетто, кг";
	Лист.Cells(3, 9).HorizontalAlignment= -4152;
	Лист.Cells(4, 9).Value	= "Объем, м3";
	Лист.Cells(4, 9).HorizontalAlignment= -4152;
	Лист.Cells(5, 9).Value	= "Сумма заказа без НДС, руб.";
	Лист.Cells(5, 9).HorizontalAlignment= -4152;
	Лист.Cells(6, 9).Value	= "Сумма заказа с НДС, руб.";
	Лист.Cells(6, 9).HorizontalAlignment= -4152;
	Лист.Cells(2,10).Interior.Color 	= Цвет_СветлоЖелтый;
	Лист.Cells(2,10).NumberFormat 		= "# ##0,000";
	Лист.Cells(3,10).Interior.Color 	= Цвет_СветлоЖелтый;
	Лист.Cells(3,10).NumberFormat 		= "# ##0,000";
	Лист.Cells(4,10).Interior.Color 	= Цвет_СветлоЖелтый;
	Лист.Cells(4,10).NumberFormat 		= "# ##0,000";
	Лист.Cells(5,10).Interior.Color 	= Цвет_СветлоЖелтый;
	Лист.Cells(5,10).NumberFormat 		= "# ##0,00";
	Лист.Cells(6,10).Interior.Color 	= Цвет_СветлоЖелтый;
	Лист.Cells(6,10).NumberFormat 		= "# ##0,00";

	//Шапка таблицы 2 строки
	Лист.Cells(8, 1).Value	= "Артикул";
	Лист.Cells(8, 2).Value	= "Штрих-код";
	Лист.Cells(8, 3).Value	= "Наименование";
	Лист.Cells(8, 4).Value	= "Заказ";
	Лист.Cells(9, 4).Value	= "шт.";
	Лист.Cells(8, 5).Value	= "Кол-во в кор.";
	Лист.Cells(9, 5).Value	= "шт.";
	Лист.Cells(8, 6).Value	= "Цена за шт. без НДС";
	Лист.Cells(9, 6).Value	= "руб.";
	Лист.Cells(8, 7).Value	= "Заказ";
	Лист.Cells(9, 7).Value	= "кор.";
	Лист.Cells(8, 8).Value	= "Сумма без НДС";
	Лист.Cells(9, 8).Value	= "руб.";
	Лист.Cells(8, 9).Value	= "Ставка НДС";
	Лист.Cells(8,10).Value	= "Сумма с НДС";
	Лист.Cells(9,10).Value	= "руб.";

	// Доп колонки, позже поставим размер 0
	Лист.Columns(12).ColumnWidth 	= 0;
	Лист.Columns(13).ColumnWidth 	= 0;
	Лист.Columns(14).ColumnWidth 	= 0;
	Лист.Columns(16).ColumnWidth 	= 0;
	Лист.Columns(17).ColumnWidth 	= 0;
	Лист.Columns(18).ColumnWidth 	= 0;
	Лист.Cells(8,12).Value	= "Вес";
	Лист.Cells(8,13).Value	= "ВесНетто";
	Лист.Cells(8,14).Value	= "Объем";
	Лист.Cells(8,16).Value	= "Итого Вес";
	Лист.Cells(8,17).Value	= "Итого ВесНетто";
	Лист.Cells(8,18).Value	= "Итого Объем";

	//Введем Формулы Итогов по столбцам
	Лист.Cells(2, 10).FormulaLocal = "=Сумм(P11:P1000)";
	Лист.Cells(3, 10).FormulaLocal = "=Сумм(Q11:Q1000)";
	Лист.Cells(4, 10).FormulaLocal = "=Сумм(R11:R1000)";
	Лист.Cells(5, 10).FormulaLocal = "=Сумм(H11:H1000)";
	Лист.Cells(6, 10).FormulaLocal = "=Сумм(J11:J1000)";

	Лист.Cells(8, 4).Font.Size 			= 12;
	Лист.Cells(9, 4).Font.Size 			= 12;

	//выравниваем по центру
	ВыравнитьПоГоризонтуЦентр(Лист, 8, 10);
	ВыравнитьПоГоризонтуЦентр(Лист, 9, 10);
	//закрасим серым цветом
	ВыделитьЦветомСтроку(Лист, 8, 10,Цвет_СветлоСерый);
	ВыделитьЦветомСтроку(Лист, 9, 10,Цвет_СветлоСерый);
	//колонка 4 заливается светло зеленым
	Лист.Cells(8, 4).Interior.Color 	= Цвет_СветлоСветлоЗеленый;
	Лист.Cells(9, 4).Interior.Color 	= Цвет_СветлоСветлоЗеленый;
	//зададим жирный шрифт
	Лист.Cells(2, 3).Font.Bold 			= 1;
	Лист.Cells(3, 3).Font.Bold 			= 1;
	Лист.Cells(4, 3).Font.Bold 			= 1;
	Лист.Cells(4, 6).Font.Bold 			= 1;
	Лист.Cells(2,10).Font.Bold 			= 1;
	Лист.Cells(3,10).Font.Bold 			= 1;
	Лист.Cells(4,10).Font.Bold 			= 1;
	Лист.Cells(5,10).Font.Bold 			= 1;
	Лист.Cells(6,10).Font.Bold 			= 1;
	ВыделимЖирнымШрифтом(Лист, 8, 10);
	ВыделимЖирнымШрифтом(Лист, 9, 10);
	//переносить по словам
	ПереноситьПоСловам(Лист, 8, 10);
	//Установка цвета рамки
	УстановкаЦветаРамки(Лист, 8, 10);
	УстановкаЦветаРамки(Лист, 9, 10);
			
			
	//Заполнение табличной части			
	ОбработкаДанныхТабличнойЧасти(Лист, ТекКонтрагент);		
			
			
			
	//пробуем закрепить область		
	//Лист.Columns(2).Select();       //столбец
	//Лист.Range("J10").Select();      //область
	//Лист.Application.ActiveWindow.SplitRow = 2;
	//Лист.Application.ActiveWindow.FreezePanes = 1;
	
	//Установит АвтоФильтр
	//Ячейки=Лист.Cells;
	//Диапазон=Лист.UsedRange;
	//Колонки = Диапазон.Columns;
	//Диапазон = Ячейки.Range(Диапазон.Cells(8, 1), Диапазон.Cells(8, Колонки.Count));
	//Диапазон.AutoFilter();
	//Рабочие строки, но работает если не ставить пароль
	//Диапазон = Лист.Range(Лист.UsedRange.Cells(8, 1), Лист.UsedRange.Cells(1000,10));
	//Диапазон.AutoFilter();
			
	//установка защиты на лист
	Если СтавимЗащиту Тогда
		Лист.Protect("1qaz");	
	КонецЕсли;
	//освободить область для редактирования
	
	
	ТипФайла = 51; //Если запись в формате xls - тип файла -4143
	
	ИмяФайла	=	"БланкЗаказа_"+ОчиститьНаименование(Организация.Наименование)+"_"+ОчиститьНаименование(ТекКонтрагент.Наименование)+"_"+СокрЛП(ТекКонтрагент.ИНН)+".xlsx";
	
	//проверить на флеш
	Если НЕ Сред(СокрЛП(ПутьККаталогуЗаписи),СтрДлина(СокрЛП(ПутьККаталогуЗаписи)),1) ="\" Тогда
		ПутьККаталогуЗаписи	=	ПутьККаталогуЗаписи+"\";
	КонецЕсли;
	Книга.SaveAs(ПутьККаталогуЗаписи + ИмяФайла, ТипФайла);
	Попытка
		Книга.Close(Ложь);
		Эксель.DisplayAlerts = 1;
		Эксель.Quit();
		Сообщить("Выгружен файл " + ИмяФайла);
	Исключение
		Информация = ИнформацияОбОшибке();
		Сообщить(Информация.Описание);
	КонецПопытки;
	
	Если ОтправитьЭлСообщение Тогда
		
		АдресПолучателя	=	ПолучитьКонтактнуюИнформацию(ТекКонтрагент, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("000000090"));
		СоздатьПисьмо(АдресПолучателя, ПутьККаталогуЗаписи + ИмяФайла, ТекКонтрагент);
	КонецЕсли;
КонецФункции

Функция ВыгрузитьПрайсЛист(ТекКонтрагент) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ТекКонтрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекКонтрагент.ОсновнойДоговорКонтрагента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Организация	=	ТекКонтрагент.ОсновнойДоговорКонтрагента.Организация;	
	ЗаполнитьШапкуБланкЗаказ(ТекКонтрагент.ОсновнойДоговорКонтрагента);
КонецФункции

Функция ВыгрузитьПрайсЛистПоДоговору() Экспорт 
	//выполняется если заполнен договор
	Организация	=	ДоговорыКонтрагента.Организация;	
	ЗаполнитьШапкуБланкЗаказ(ДоговорыКонтрагента);
КонецФункции;

ТекСтрокаТЧ	=	10;

Цвет_СветлоЗеленый		= ((153*256) + 255) * 256 + 204;	
Цвет_СветлоЖелтый		= ((150*256) + 255) * 256 + 255;	
Цвет_СветлоКоричневый	= ((150*256) + 255) * 256 + 255;	
Цвет_СветлоСерый		= ((200*256) + 200) * 256 + 200;	
Цвет_Красный			= ((0*256) + 0) * 256 + 255;	
Цвет_Зеленый			= ((0*256) + 255) * 256 + 0;	
Цвет_Синий				= ((255*256) + 0) * 256 + 0;	
Цвет_СветлоСветлоЗеленый= ((225*256) + 255) * 256 + 225;	


			//ТекКолонка	=	0;
			//Пока ТекКолонка<10 Цикл
			//	ТекКолонка	=	ТекКолонка+1;
			//	//Лист.Cells(8, ТекКолонка).HorizontalAlignment= -4108;
			//	//Лист.Cells(9, ТекКолонка).HorizontalAlignment= -4108;
			//	//Лист.Cells(8, ТекКолонка).Interior.Color 	= Цвет_СветлоСерый;
			//	//Лист.Cells(9, ТекКолонка).Interior.Color 	= Цвет_СветлоСерый;
			//	//Лист.Cells(8, ТекКолонка).Font.Bold = 1;
			//	//Лист.Cells(9, ТекКолонка).Font.Bold = 1;
			//	//Лист.Cells(8, ТекКолонка).WrapText = True;
			//	//Лист.Cells(8, ТекКолонка).Borders.Color = 1;
			//	//Лист.Cells(9, ТекКолонка).Borders.Color = 1;

			//КонецЦикла;	
	//Для СтрокаНомер = 1 По 3 Цикл
	//	//Записываем значения строки
	//	Для КолонкаНомер = 1 По 5 Цикл
	//		Лист.Cells(СтрокаНомер, КолонкаНомер).Value = СтрокаНомер * КолонкаНомер;
	//	КонецЦикла;
	//	//Записываем изображение
	//	СтрокаКартинка = Элементы["Изображение" + СтрокаНомер].Картинка;
	//	ВременныйФайл = ПолучитьИмяВременногоФайла("" + СтрокаКартинка.Формат());
	//	СтрокаКартинка.Записать(ВременныйФайл);
	//	ЛистИзображение = Лист.Shapes.AddPicture(ВременныйФайл, Ложь, Истина, Лист.Cells(СтрокаНомер, 6).Left + 1, Лист.Cells(СтрокаНомер, 6).Top + 1, -1, -1);
	//	ЛистИзображение.Placement = 1;
	//	ЛистИзображение.LockAspectRatio = 0;
	//	//Масштабирование изображения
	//	ЛистИзображение.Width = 47;
	//	ЛистИзображение.Height = 29;
	//	Лист.Rows(СтрокаНомер).RowHeight = 33;
	//	ЛистИзображение.Height = 29;
	//	УдалитьФайлы(ВременныйФайл);
	//КонецЦикла;
